DataProcessors/ОбработкаСтрокТЧ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.0">
	<DataProcessor>
		<Properties>
			<Name>ОбработкаСтрокТЧ</Name>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаСНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

DataProcessors/ОбработкаСтрокТЧ/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура ТоварыПриИзменении(Элемент)
	ЭлементТабличнаяЧасть = Элементы.Товары;
	ЭлементТекущаяКолонка = ЭлементТабличнаяЧасть.ТекущийЭлемент.Имя;
	ИмяРеквизита = Сред(ЭлементТекущаяКолонка, СтрДлина(ЭлементТабличнаяЧасть.Имя) + 1);
	ОбработатьСтрокуТЧ(ИмяРеквизита);
КонецПроцедуры

Процедура ОбработатьСтрокуТЧ(ИмяИзменяемогоРеквизита)
	МассивИзмененныхРеквизитов = Новый Массив;
	МассивИзмененныхРеквизитов.Добавить(ИмяИзменяемогоРеквизита);
	
	ТекущаяСтрока = Объект.Товары.НайтиПоИдентификатору(Элементы.Товары.ТекущаяСтрока);
	
	// обратные зависимости
	Если МассивИзмененныхРеквизитов.Найти("Сумма") <> Неопределено Тогда
		Если ТекущаяСтрока.Количество Тогда
			ТекущаяСтрока.Цена = ТекущаяСтрока.Сумма / ТекущаяСтрока.Количество;
		Иначе
			ТекущаяСтрока.Цена = ТекущаяСтрока.Сумма; 
		КонецЕсли;
	КонецЕсли;
	
	// прямые зависимости
	Если МассивИзмененныхРеквизитов.Найти("Цена") <> Неопределено
		ИЛИ МассивИзмененныхРеквизитов.Найти("Количество") <> Неопределено
		Тогда
		
		ТекущаяСтрока.Сумма = ТекущаяСтрока.Цена * ТекущаяСтрока.Количество;
		
		МассивИзмененныхРеквизитов.Добавить("Сумма");
	КонецЕсли;
	
	Если МассивИзмененныхРеквизитов.Найти("Сумма") <> Неопределено Тогда
		ТекущаяСтрока.СуммаСНДС = ТекущаяСтрока.Сумма * 1.18;
	КонецЕсли;
	
	
КонецПроцедуры
